;--------------------------------------------
; スプライト関連の処理
; スプライトのパターン定義が主処理
;--------------------------------------------

;--------------------------------------------
; SUB-ROUTINE: CreateSpritePattern
; スプライトパターンと
; 仮想スプライトアトリビュートテーブルを作成する
;--------------------------------------------
CreateSpritePattern:

    ;-------------------------------------------
    ; VRAM領域の初期化（ゼロクリア）
    ;-------------------------------------------
    ld (hl), a
    ld hl, $1B00 ; 
    ld bc, $0500 ; 1B00H-1FFFHまでのアドレスを0で埋める
    xor a
    call WRTVRMFIL

    ld (hl), a
    ld hl, $3800 ; 
    ld bc, $0800 ; 3800H-3EFFHまでのアドレスを0で埋める
    xor a
    call WRTVRMFIL

    ;--------------------------------------------
    ; スプライトパターンデータの固定データを
    ; RAMのスプライトパターンデータテーブルに
    ; 転送する
    ;--------------------------------------------
    ld hl, SPRPTN
    ld de, WK_SPRITE_PTNTBL
    ld bc, 2048
    call MemCpy

    ; 仮想スプライトアトリビュートテーブルを初期化する
    call InitializeVirtSpritePattern

    ret
    
