;--------------------------------------------
; data_enemy.asm 
; テキキャラ関連データ集
;--------------------------------------------

; テキキャラのスポーン位置
ENEMY_SPAWN_POS:
    defb 43,  1 ; テキキャラ# 0 - # 4の出現位置
    defb 30,  3 ; テキキャラ# 5 - # 9の出現位置
    defb 17,  4 ; テキキャラ#10 - #14の出現位置
    defb  5,  5 ; テキキャラ#15 - #19の出現位置
    defb 41,  5 ; テキキャラ#20 - #24の出現位置
    defb 19,  7 ; テキキャラ#25 - #29の出現位置
    defb 29, 12 ; テキキャラ#30 - #34の出現位置
    defb 26, 14 ; テキキャラ#35 - #39の出現位置
    defb  6, 16 ; テキキャラ#35 - #39の出現位置
    defb 43, 16 ; テキキャラ#40 - #44の出現位置
    defb 27, 18 ; テキキャラ#45 - #49の出現位置
    defb 38, 21 ; テキキャラ#50 - #54の出現位置
    defb  8, 26 ; テキキャラ#55 - #59の出現位置
    defb 22, 26 ; テキキャラ#60 - #64の出現位置
    defb 41, 28 ; テキキャラ#65 - #69の出現位置
    defb  1, 32 ; テキキャラ#70 - #74の出現位置
