;--------------------------------------------
; data_enemy.asm 
; テキキャラ関連データ集
;--------------------------------------------

; テキキャラのスポーン位置
ENEMY_SPAWN_POS:
    defb 37,  1 ; テキキャラ# 0 - # 4の出現位置
    defb 34, 16 ; テキキャラ# 5 - # 9の出現位置
    defb  4,  6 ; テキキャラ#10 - #14の出現位置
    defb 23,  6 ; テキキャラ#15 - #19の出現位置
    defb 43, 10 ; テキキャラ#20 - #24の出現位置
    defb 17, 12 ; テキキャラ#25 - #29の出現位置
    defb  8, 13 ; テキキャラ#30 - #34の出現位置
    defb 34, 13 ; テキキャラ#35 - #39の出現位置
    defb 10, 23 ; テキキャラ#35 - #39の出現位置
    defb 28, 23 ; テキキャラ#40 - #44の出現位置
    defb 19, 30 ; テキキャラ#45 - #49の出現位置
    defb 29, 30 ; テキキャラ#50 - #54の出現位置
    defb 39, 32 ; テキキャラ#55 - #59の出現位置
    defb  5, 34 ; テキキャラ#60 - #64の出現位置
    defb 10, 41 ; テキキャラ#65 - #69の出現位置
    defb 36, 42 ; テキキャラ#70 - #74の出現位置
