;--------------------------------------------
; INCLUDE
;--------------------------------------------
include "initialize.asm"

;--------------------------------------------
; メイン処理
;--------------------------------------------
Main:

    ;--------------------------------------------
    ; キャラクタパターンとカラーテーブルを
    ; 作成する
    ;--------------------------------------------
    call CreateCharacterPattern

    ;--------------------------------------------
    ; 文字コード80Hの文字を256バイトぶん
    ; VRAMのパターンネームテーブルに埋める
    ; (横32文字 x 縦8行＝256バイト)
    ;--------------------------------------------
    ld hl, $1800
    ld  a, $80
    call PutVRAM256Bytes

    ;--------------------------------------------
    ; 文字コード88Hの文字を256バイトぶん
    ; VRAMのパターンネームテーブルに埋める
    ; (横32文字 x 縦8行＝256バイト)
    ;--------------------------------------------
    ld hl, $1900
    ld  a, $88
    call PutVRAM256Bytes

    ;
    ; 16バイト分のデータを画面にDUMP出力する
    ;
    ld hl, CHRPTN       ; CHRPTNのアドレスの内容を
    ld de, WK_DUMPDATA  ; WK_DUMPDATAのアドレスに
    ld bc, 16           ; 16バイト転送する
    ldir

    call PrintHexaDump

    ;
    ; WK_DUMPCHARのアドレスの内容を
    ; 画面上の下段(1A00H)に32バイト転送する
    ;
    ld de, $1A00
    call HexaDumpToVRAM

MainEnd:
    jr MainEnd

;-----------------------------------------------
; INCLUDE
;-----------------------------------------------
include "pcg_graphic1.asm"
include "common.asm"
include "data.asm"
