;--------------------------------------------
; data_sprite.asm
; 固定データ(スプライト作成用)
;--------------------------------------------
; キャラクタパターン
SPRPTN:

; PLAYTER(左向き)
; データサイズは1体あたり64バイト

; SPRITE#0-#3 = COLOR #0D
; SPRITE#4-$7 = COLOR #0F
defb $0F, $1F, $1B, $01, $00, $00, $00, $00 ; SPRITE#0
defb $00, $00, $00, $00, $00, $20, $3E, $1E ; SPRITE#1
defb $F8, $F8, $FC, $FC, $7C, $74, $14, $08 ; SPRITE#2
defb $00, $1C, $1C, $1C, $00, $00, $38, $38 ; SPRITE#3
defb $00, $00, $04, $1E, $15, $15, $15, $0F ; SPRITE#4
defb $10, $1F, $1B, $1F, $1B, $0F, $00, $00 ; SPRITE#5
defb $00, $00, $00, $00, $80, $88, $E8, $F0 ; SPRITE#6
defb $F8, $E0, $E0, $E0, $F8, $F0, $00, $00 ; SPRITE#7
