;--------------------------------------------
; INCLUDE
;--------------------------------------------
include "initialize.asm"

;--------------------------------------------
; メイン処理
;--------------------------------------------
Main:

    ;--------------------------------------------
    ; キャラクタパターンとカラーテーブルを
    ; 作成する
    ;--------------------------------------------
    call CreateCharacterPattern

    ;--------------------------------------------
    ; キャラクタパターンとカラーテーブルを
    ; 作成する
    ;--------------------------------------------
    call CreateSpritePattern

    ld a, 14
    ld (WK_PLAYERPOSX), a ; プレイヤーのX座標の初期化
    ld a, 10
    ld (WK_PLAYERPOSY), a ; プレイヤーのY座標の初期化

    call PutSprite ; スプライトの表示

    ;--------------------------------------------
    ; 文字コード80Hの文字を256バイトぶん
    ; VRAMのパターンネームテーブルに埋める
    ; (横32文字 x 縦8行＝256バイト)
    ;--------------------------------------------
    ld hl, $1800
    ld  a, $80
    call PutVRAM256Bytes

    ;--------------------------------------------
    ; 文字コード80Hの文字を256バイトぶん
    ; VRAMのパターンネームテーブルに埋める
    ; (横32文字 x 縦8行＝256バイト)
    ;--------------------------------------------
    ld hl, $1900
    ld  a, $80
    call PutVRAM256Bytes

    ;--------------------------------------------
    ; 文字コード80Hの文字を256バイトぶん
    ; VRAMのパターンネームテーブルに埋める
    ; (横32文字 x 縦8行＝256バイト)
    ;--------------------------------------------
    ld hl, $1A00
    ld  a, $80
    call PutVRAM256Bytes

    ;
    ; 16バイト分のデータを画面にDUMP出力する
    ;
    ld hl, CHRPTN       ; CHRPTNのアドレスの内容を
    ld de, WK_DUMPDATA  ; WK_DUMPDATAのアドレスに
    ld bc, 16           ; 16バイト転送する
    ldir

    call PrintHexaDump

    ;
    ; WK_DUMPCHARのアドレスの内容を
    ; 画面上の下段(1AE0H)に32バイト転送する
    ;
    ld de, $1AE0
    call HexaDumpToVRAM

MainEnd:
    jr MainEnd

;-----------------------------------------------
; INCLUDE
;-----------------------------------------------
include "common.asm"
include "sprite.asm"
include "data_sprite.asm"
include "pcg_graphic2.asm"
include "data_pcg.asm"
